[
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91a"
        },
        "name": "Artificial Intelligence A-Z™: Learn How To Build An AI",
        "img": "https://img-c.udemycdn.com/course/480x270/1219332_bdd7.jpg",
        "details": "<p><strong></strong></p>\n\n<p><strong>*** AS SEEN ON KICKSTARTER ***</strong></p><p>Learn key AI concepts and intuition training to get you quickly up to speed with all things AI. Covering:<br></p>\n\n<ul><li>How to <strong>start building AI </strong>with no previous coding experience using Python</li><li>How to <strong>merge AI with OpenAI Gym</strong> to learn as effectively as possible</li><li>How to<strong> optimize your AI </strong>to reach its maximum potential in the real world</li></ul>\n\n<p>Here is what you will get with this course:</p>\n\n<p><strong></strong></p>\n\n<p><strong>1. Complete beginner to expert AI skills</strong> – Learn to code self-improving AI for a range of purposes. In fact, we code together with you. Every tutorial starts with a blank page and we write up the code from scratch. This way you can follow along and understand exactly how the code comes together and what each line means.</p>\n\n\n\n<p><strong>2. Code templates – </strong>Plus, you’ll get downloadable Python code templates for every AI you build in the course. This makes building truly unique AI as simple as changing a few lines of code. If you unleash your imagination, the potential is unlimited.</p>\n\n\n\n<p><strong>3. Intuition Tutorials –</strong> Where most courses simply bombard you with dense theory and set you on your way, we believe in developing a deep understanding for not only what you’re doing, but why you’re doing it. That’s why we don’t throw complex mathematics at you, but focus on building up your intuition in coding AI making for infinitely better results down the line.</p>\n\n\n\n<p><strong>4. Real-world solutions –</strong> You’ll achieve your goal in not only 1 game but in 3. Each module is comprised of varying structures and difficulties, meaning you’ll be skilled enough to build AI adaptable to any environment in real life, rather than just passing a glorified memory “test and forget” like most other courses. Practice truly does make perfect.</p>\n\n\n\n<p><strong>5. In-course support –</strong> We’re fully committed to making this the most accessible and results-driven AI course on the planet. This requires us to be there when you need our help. That’s why we’ve put together a team of professional Data Scientists to support you in your journey, meaning you’ll get a response from us within 48 hours maximum.</p>",
        "slug": "/course/artificial-intelligence-az/",
        "author": "Hadelin de Ponteves",
        "price": "93.24",
        "description": "Combine the power of Data Science, Machine Learning and Deep Learning to create powerful AI for Real-World applications!",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Artificial Intelligence",
        "subcategory": ["Data Science"],
        "date": "2017-05-17T14:19:34Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91b"
        },
        "name": "Create E-commerce Web Application Using Node JS",
        "img": "https://img-c.udemycdn.com/course/480x270/4977502_ac7a.jpg",
        "details": "<p><em>This courses will teach you</em><strong><em> how to create e-commerce website using Node JS.</em></strong></p><p>In this course you will <strong>learn how to build e-commerce website using Node JS</strong>. Learning how to build an e-commerce website that lets customers order from you will give you the opportunity to build a real-world, in-demand project and will open up the door of opportunity for you to become a professional Full-Stack developer.</p><p>First, you will learn how to install Node environment, then you will learn how to incorporate an HTML &amp; CSS template. Then you will be taught the most important parts of this projects such as creating a cart and letting customers checkout. Thereafter, you will be taught how to integrate <strong>Paypal Payment system </strong>so that customers will pay you.</p><p>You will also learn how to integrate PayPal correctly so that you receive money for your meals. PayPal is one of the most powerful payment systems. By integrating PayPal into your Node website you will learn a very important skill that is indispensable these days in any website.</p><p>By the end of this course you will have built a project using Node that is capable of letting customers buy meals online while you have a control over the business and the website.</p><p><br></p><p><strong>Why should you take this course?</strong></p><p>There are many reasons why this course is extremely important. </p><p>1. You will build a real-world web app, rather than building unrealistic project.</p><p>2. I will teach you the \"how-to\" rather than concepts that you will end up abandoning.</p><p>3. You will learn HTML, CSS, Node &amp; MySql and how they can work together.</p><p>4. You will learn Full-Stack development and become a professional one having build a complete e-commerce website.</p><p><br></p><p><strong>Some of What You Will Learn in This Course:</strong></p><p>1. Install project environment &amp; create project.</p><p>2. Run Node project files.</p><p>3. Structure your project.</p><p>4. How to add a complete HTML&nbsp;&amp;&nbsp;CSS Template.</p><p>5. Logic behind building complete e-commerce website.</p><p>6. How to let customers add products to cart.</p><p>7. How to let customers make orders and checkout.</p><p>8. How to integrate Paypal Payment System.</p><p>9. How to manage your database.</p><p>10. Best practices and techniques.</p><p>11. Organize your project.</p><p>12. Much much more...</p><p><br></p><p>Wish you an incredible learning journey.</p>",
        "slug": "/course/create-e-commerce-web-application-using-node-js/",
        "author": "Mustafa Alawi",
        "price": "72.04",
        "description": "Create E-commerce Website Using Node JS From Scratch",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["NodeJS"],
        "date": "2022-11-14T16:26:08Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91c"
        },
        "name": "Data Science & Machine Learning: Naive Bayes in Python",
        "img": "https://img-c.udemycdn.com/course/480x270/4929064_b97d.jpg",
        "details": "<p>In this self-paced course, you will learn how to apply Naive Bayes to many real-world datasets in a wide variety of areas, such as:</p><ul><li><p>computer vision</p></li><li><p>natural language processing</p></li><li><p>financial analysis</p></li><li><p>healthcare</p></li><li><p>genomics</p></li></ul><p>Why should you take this course?&nbsp;Naive Bayes is one of the fundamental algorithms in machine learning, data science, and artificial intelligence. No practitioner is complete without mastering it.</p><p>This course is designed to be appropriate for all levels of students, whether you are beginner, intermediate, or advanced. You'll learn both the intuition for how Naive Bayes works and how to apply it effectively while accounting for the unique characteristics of the Naive Bayes algorithm. You'll learn about when and why to use the different versions of Naive Bayes included in Scikit-Learn, including GaussianNB, BernoulliNB, and MultinomialNB.</p><p>In the advanced section of the course, you will learn about how Naive Bayes really works under the hood. You will also learn how to implement several variants of Naive Bayes from scratch, including Gaussian Naive Bayes, Bernoulli Naive Bayes, and Multinomial Naive Bayes. The advanced section will require knowledge of probability, so be prepared!</p><p>Thank you for reading and I hope to see you soon!</p><p><br></p><p>Suggested Prerequisites:</p><ul><li><p>Decent Python programming skill</p></li><li><p>Comfortable with data science libraries like Numpy and Matplotlib</p></li><li><p>For the advanced section, probability knowledge is required</p></li></ul><p><br></p><p>WHAT&nbsp;ORDER&nbsp;SHOULD&nbsp;I&nbsp;TAKE&nbsp;YOUR&nbsp;COURSES&nbsp;IN?</p><ul><li><p>Check out the lecture \"Machine Learning and AI&nbsp;Prerequisite Roadmap\" (available in the FAQ of any of my courses, including my free course)</p></li></ul><p><br></p><p>UNIQUE&nbsp;FEATURES</p><ul><li><p>Every line of code explained in detail - email me any time if you disagree</p></li><li><p>Less than 24 hour response time on Q&amp;A&nbsp;on average</p></li><li><p>Not afraid of university-level math - get important details about algorithms that other courses leave out</p></li></ul>",
        "slug": "/course/data-science-machine-learning-naive-bayes-in-python/",
        "author": "Lazy Programmer Inc.",
        "price": "72.04",
        "description": "Master a crucial artificial intelligence algorithm and skyrocket your Python programming skills",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Artificial Intelligence",
        "subcategory": ["Data Science"],
        "date": "2022-10-14T19:42:26Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91d"
        },
        "name": "Build Responsive Real-World Websites with HTML and CSS",
        "img": "https://img-c.udemycdn.com/course/480x270/437398_46c3_10.jpg",
        "details": "<p><strong><em>*** The #1 bestselling HTML and CSS course on Udemy! ***</em></strong></p><p><strong><em>*** Completely re-built from scratch in July 2021 (35+ hours video) ***</em></strong></p><p><em>\"Having gone through other related courses on other platforms, I can say this course is the most practical and readily applicable course on web design and development I have taken.\" — Bernie Pacis</em></p><p><br></p><p>Open a new browser tab, type in <strong><em>www.omnifood.dev</em></strong>, and take a look around. I will wait here...</p><p>...</p><p>Amazing, right? What if you knew exactly how to design and build a website like that, completely from scratch? How amazing would that be?</p><p>Well, I'm here to teach you<strong> HTML, CSS, and web design, all by building the stunning website that you just saw</strong>, step-by-step.</p><p>So, after finishing this course, you will know exactly how to build a beautiful, professional, and ready-to-launch website just like Omnifood, by following a 7-step process. And it will even look great on any computer, tablet, and smartphone.</p><p>But what if you want to build a completely different website? Well, no problem! I designed the course curriculum with exactly this goal: to <strong>enable you to design and build any website that you can think of, not just copy the course project</strong>.</p><p><br></p><p><strong>So, in order to become a confident and independent developer, capable of building your own websites in the future, you will learn:</strong></p><ul><li><p>The fundamentals of modern and semantic HTML, CSS, and building layouts in a small separate project, which will prepare you for the main course project (<em>www.omnifood.dev</em>). This includes modern flexbox and CSS Grid!</p></li><li><p>How to design beautiful websites, by learning a web design framework I created just for this course. It consists of easy-to-use guidelines for design aspects like typography, colors, images, spacing, and more (this is like a small standalone course!).</p></li><li><p>How to use well-established website components and layout patterns in order to come up with professional-looking designs</p></li><li><p>How to make any website work on any mobile device, no matter the design and layout (responsive design)</p></li><li><p>How to use the 7 steps of building a professional website in practice: planning, sketching, designing, building, testing, optimizing, and launching</p></li><li><p>How to find and use free design assets such as images, fonts, and icons</p></li><li><p>Important developer skills such as reading documentation, fixing code errors on your own, and using professional web development tools</p></li></ul><p><strong>Does this sound like fun? Then join me and 200,000+ other developers and start building websites today!</strong></p><p><em>Or are you not sold yet and need to know more? No problem, just keep reading...</em></p><p><br></p><p><strong>[01] Why should you learn HTML and CSS in the first place?</strong></p><p>Building websites allows you to do <strong>fun and creative work, from anywhere in the world, and it even pays well</strong>. Web development is one of the <strong>most future-proof and highest-paying industries</strong> in the world. And HTML and CSS is the entry point to this world!</p><p>But you already know all this, that's why you want to learn HTML and CSS too. Well, you came to the right place!</p><p>This is the best and most complete course for starting your web development journey that you will find on Udemy. It's an <strong>all-in-one package</strong> that takes you from knowing nothing about HTML and CSS, to building beautiful websites using tools and technologies that professional web developers use every single day.</p><p><br></p><p><strong>[02] Why is this course so unique and popular?</strong></p><p><strong><em>Reason #1: The course is completely project-based</em></strong></p><p>Simple demos are boring, and therefore you're gonna learn everything by <strong>building actual projects</strong>! In the final project (<em>www.omnifood.dev</em>), together we hand-code a beautiful and responsive landing page for a <strong>fictional company</strong> that I made up just for the course.</p><p><br></p><p><strong><em>Reason #2: You will not just learn how to code</em></strong></p><p>Coding is great, but it's not everything! That's why we will go through the entire <strong>7-step process</strong> of building and launching our website project.</p><p>So the huge Omnifood project will teach you <strong>real-world skills to build real-world HTML and CSS websites</strong>: how to plan projects and page layouts, how to implement designs using HTML and CSS techniques, how to write clean and organized code, how to optimize websites for good speed performance, and many more.</p><p>On top of that, this course has a <strong>huge focus on beautiful design</strong>. In fact, this is the only course on the market that focuses on both coding and designing, together.</p><p><br></p><p><strong><em>Reason #3: I'm the right teacher for you</em></strong></p><p>With the right guidance and a well-structured curriculum, building websites can be <strong>quite easy and fun to learn</strong>. With a bunch of random tutorials and YouTube videos? Not so much. And that's where I come in.</p><p>My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2015 to over 200,000 developers, always listening to feedback and understanding exactly how students actually learn.</p><p>Using that feedback, I recently rebuilt this course from scratch and <strong>designed the ideal course curriculum</strong> for every type of student. It's a <strong>unique blend</strong> of projects, deep explanations, theory lectures, and challenges. I'm sure you're gonna love it!</p><p><br></p><p><strong>[03] Why is this course so long?</strong></p><p><strong>Reason #1:</strong> I take time to <strong>explain every single concept</strong> that I teach, so that you actually learn, and not just copy code from the screen (<strong>this is a course</strong>, not a tutorial)</p><p><strong>Reason #2:</strong> I go into topics that other HTML and CSS courses shy away from: professional web design, component and layout patterns, some CSS theory, website planning in theory and practice, and developer skills. I believe you need all of this to be successful!</p><p><strong>Reason #3:</strong> There is a lot of repetition, so that you actually <strong>assimilate and practice</strong> what you learn. Practice is the single most important ingredient to learning, and therefore I provide plenty of opportunities for you to sharpen your skills</p><p><br></p><p><strong>[04] Here is what's also included in the package:</strong></p><ul><li><p>Up-to-date HD-quality videos, that are easy to search and reference (great for Udemy Business students)</p></li><li><p>Professional English captions (not the&nbsp;auto-generated ones)</p></li><li><p>Downloadable design assets + starter code and final code for each section</p></li><li><p>Downloadable slides for 20+ theory videos (not boring, I promise!)</p></li><li><p>Access to countless free design and development resources that I curated over many years</p></li><li><p>Free support in the course Q&amp;A</p></li><li><p>10+ coding challenges to practice your new skills (solutions included)</p></li></ul><p><br></p><p><strong>[05] This course is for you if...</strong></p><ul><li><p>... you are a complete beginner with no idea of how to build a website.</p></li><li><p>... you already know a bit of HTML and CSS from some tutorials or videos, but struggle to put together a good-looking, complete website.</p></li><li><p>... you are a designer and want to expand your skills into HTML and CSS, because all your designer friends are learning how to code (they are smart!).</p></li></ul><p>Basically, if you are an HTML and CSS master, and build the most beautiful websites in the world, then DON'T take the course. Everyone else: you should take the course, today.</p><p><br></p><p><strong><em>So, does all of this sound great? Then join me and 200,000+ other developers and start your web development journey today!</em></strong></p>",
        "slug": "/course/design-and-develop-a-killer-website-with-html5-and-css3/",
        "author": "Jonas Schmedtmann",
        "price": "105.96",
        "description": "Learn modern HTML5, CSS3 and web design by building a stunning website for your portfolio! Includes flexbox and CSS Grid",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["HTML", "CSS"],
        "date": "2015-03-03T10:16:03Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91e"
        },
        "name": "End-to-end data science and machine learning project",
        "img": "https://img-c.udemycdn.com/course/480x270/3681724_0b88_2.jpg",
        "details": "<p>Welcome to the course wine quality prediction! In this course you will learn how to work with data from end-to-end and create a machine learning model that predicts the quality of wines.</p><p>This data set contains records related to red and white variants of the Portuguese Vinho Verde wine. It contains information from 1599 red wine samples and 4898 white wine samples. Input variables in the data set consist of the type of wine (either red or white wine) and metrics from objective tests (e.g. acidity levels, PH values, ABV, etc.).</p><p>It is super important to notice that <strong>you will need python knowledge</strong> to be able to understand this course. You are going to develop everything using Google Colab, so there is no need to download Python or Anaconda. You also need <strong>basic knowledge of Machine Learning</strong> and <strong>data science</strong>, but don't worry we will cover the theory and the practical needs to understand how each of the models that we are going to use work.</p><p>In our case, we will work with a <strong>classification problem</strong> (a set from the <strong>supervised learning</strong> algorithms). That means that we will use the quality as the target variable and the other variables as the inputs. In this sense, we will some examples to train our model and predict the quality of other wines.</p><p>You will learn to work with Decision Trees, Logistic Regression, how to use LazyPredict and how to tune the hyperparameters using Grid Search. </p>",
        "slug": "/course/end-to-end-data-science-and-machine-learning-project/",
        "author": "Sara Malvar",
        "price": "20.31",
        "description": "Wine quality prediction",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Artificial Intelligence",
        "subcategory": ["Data Science"],
        "date": "2020-12-04T18:28:50Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e91f"
        },
        "name": "Flutter & Dart - The Complete Guide [2023 Edition]",
        "img": "https://img-b.udemycdn.com/course/480x270/1708340_7108_5.jpg",
        "details": "<p><strong>Join the most comprehensive &amp;&nbsp;bestselling Flutter course and learn how to build amazing iOS&nbsp;and Android apps!</strong></p><p><strong>You don't need to learn Android/&nbsp;Java and iOS/&nbsp;Swift&nbsp;to build real native mobile apps!</strong></p><p>Flutter - a framework developed by Google - allows you to learn one language&nbsp;(Dart) and build beautiful native mobile apps in no time. Flutter is a SDK&nbsp;providing the tooling to compile&nbsp;Dart code into native code and it also gives you a rich set of pre-built and pre-styled UI&nbsp;elements (so called widgets)&nbsp;which you can use to compose your user interfaces.</p><p><strong>Flutter is extremely&nbsp;trending</strong> and gets used for major Google apps like their Adwords app - it's now marked as \"ready for production\", hence now is the time to jump in and learn it!</p><p>This course will teach Flutter &amp; Dart from scratch, NO&nbsp;prior knowledge of either of the two is required!&nbsp;And you certainly don't need any Android or iOS&nbsp;development experience since the whole idea behind Flutter is to only learn one language.</p><p>You'll learn Flutter not only in theory but <strong>we'll build a complete, realistic app</strong> throughout this course. This app will feature both all the core basics as well as advanced features like using Google Maps, the device camera, adding animations and more!</p><p><strong>With Flutter, you'll be able to write code only once and ship your apps both to the Apple AppStore and Google Play.</strong></p><p>Use Google's Material Design to build beautiful, yet fully customizable, apps in no time with almost zero effort. You can use the rich widget suite Flutter provides to add common UI&nbsp;elements like buttons, switches, forms, toolbars, lists and more - or you simply build your own widgets - Flutter makes that a breeze, too.</p><p><strong>Here's what's included in the course:</strong></p><ul><li><p>Detailed setup instructions for both macOS and Windows</p></li><li><p>A&nbsp;thorough introduction to Flutter, Dart and the concept behind widgets</p></li><li><p>An overview of the built-in widgets and how you may add your own ones</p></li><li><p>Debugging tipps&nbsp;&amp;&nbsp;tricks</p></li><li><p>Page navigation with tabs, side drawers and stack-based navigation</p></li><li><p>State management solutions</p></li><li><p>Handling and validating&nbsp;user input</p></li><li><p>Connecting your Flutter app to backend servers by sending Http requests</p></li><li><p>User authentication</p></li><li><p>Adding Google Maps</p></li><li><p>Using native device features like the camera</p></li><li><p>Adding beautiful animations &amp;&nbsp;page transitions</p></li><li><p>Image Upload</p></li><li><p>Push Notifications - manual approach and automated</p></li><li><p>How to publish your app to the app stores</p></li><li><p>And more!</p></li></ul><p><strong>This course is for you if ...</strong></p><ul><li><p>You're interested in building real native mobile apps for the two most popular mobile platforms - iOS&nbsp;and Android</p></li><li><p>You want to explore the full set of features Flutter offers</p></li><li><p>Don't want to spend hours learning two completely different languages</p></li></ul><p><strong>Course prerequisites:</strong></p><ul><li><p>Basic programming language knowledge&nbsp;will help a lot but is not a hard requirement</p></li><li><p>You DON'T&nbsp;need to know Flutter or Dart</p></li><li><p>You DON'T&nbsp;need to know iOS (Swift/ObjectiveC)&nbsp;or Android&nbsp;(Java)</p></li></ul>",
        "slug": "/course/learn-flutter-dart-to-build-ios-android-apps/",
        "author": "Academind by Maximilian Schwarzmüller",
        "price": "93.24",
        "description": "A Complete Guide to the Flutter SDK & Flutter Framework for building native iOS and Android apps",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Mobile Development",
        "subcategory": ["Flutter"],
        "date": "2018-05-22T08:05:27Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e920"
        },
        "name": "Learn JavaScript By Creating A Simple Number Game",
        "img": "https://img-b.udemycdn.com/course/480x270/4958404_f6f9_2.jpg",
        "details": "<p>I believe developing games is the best way to learn programming. So, in this course, we are going to create a simple game called '<em>Guess My Number'</em>. We will be developing the game for web using <strong>HTML, CSS and JavaScript</strong>. We will write all the code on screen, no copying and pasting from anywhere. By the end of the course, you will have the complete game source code ready.</p><p>Here are some things you will learn in this course:</p><ul><li><p>How to access and manipulate HTML elements using JavaScript</p></li><li><p>How to create beautiful UI&nbsp;for your games using HTML and CSS</p></li></ul><p>Here are the prerequisites for this course:</p><ul><li><p>Basic knowledge of HTML, CSS and JavaScript</p></li><li><p>A computer that can run a code editor</p></li></ul><p>This course is designed for<strong> intermediate web developers </strong>who are looking to improve their web development skills.</p><p>We will start by setting up our project and creating the necessary files. Then there will be some JavaScript essential tutorials to refresh your basic JavaScript knowledge. </p><p>We will have 3 screens in our game. The start screen has the main menu, then we will have a game screen where the user can play the game. And then in the end there will be the end screen where we will display the score of the game to the user.</p><p>We will create the UI&nbsp;using HTML and CSS. We will also add some basic animation to the screens.</p><p>Then we will start writing the logic of the game in <strong>JavaScript</strong>. The knowledge from this course will help you understand the basic process of creating a simple game using JavaScript. Now, with this knowledge, you can start creating other simple games and then transition into creating complex games.</p><p>I hope you find this course helpful.</p><p><em>Happy coding!</em></p>",
        "slug": "/course/learn-javascript-by-creating-a-simple-number-game/",
        "author": "Godson Thomas",
        "price": "23.28",
        "description": "Improve your web development skills by creating a Number Guessing game.",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["Javascript"],
        "date": "2022-11-02T18:18:33Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e921"
        },
        "name": "Math for Data Science Masterclass",
        "img": "https://img-c.udemycdn.com/course/480x270/4849126_3676_2.jpg",
        "details": "<p><strong>Welcome to the best online course for learning about the Math behind the field of Data Science!</strong></p><p>Working together for the first time ever, Krista King and Jose Portilla have combined forces to deliver you a best in class course experience in how to use mathematics to solve real world data science problems. This course has been specifically designed to help you understand the mathematical concepts behind the field of data science, so you can have a first principles level understanding of how to use data effectively in an organization.</p><p>Often students entering the field of data science are confused on where to start to learn about the fundamental math behind the concepts. This course was specifically designed to help bridge that gap and provide students a clear, guided path through the complex and interesting world of math used in the field of data science. Designed to balance theory and application, this is the ultimate learning experience for anyone wanting to really understand data science.</p><p><strong>Why choose this course?</strong></p><p>Combined together, Krista and Jose have taught over 3.2 million students about data science and mathematics and their joint expertise means you'll be able to get the best and clearest mathematical explanations from Krista with framing about real world data science applications from Jose.&nbsp; At the end of each section is a set of practice problems developed from real-world company situations, where you can directly apply what you know to test your understanding.</p><p><strong>What's covered in this course?</strong></p><p>In this course, we'll cover:</p><ul><li><p>Understanding Data Concepts</p></li><li><p>Measurements of Dispersion and Central Tendency</p></li><li><p>Different ways to visualize data</p></li><li><p>Permutations</p></li><li><p>Combinatorics</p></li><li><p>Bayes' Theorem</p></li><li><p>Random&nbsp;Variables</p></li><li><p>Joint Distributions</p></li><li><p>Covariance and Correlation</p></li><li><p>Probability Mass and Density Functions</p></li><li><p>Binomial, Bernoulli, and Poisson Distributions</p></li><li><p>Normal Distribution and Z-Scores</p></li><li><p>Sampling and Bias</p></li><li><p>Central Limit Theorem</p></li><li><p>Hypothesis Testing</p></li><li><p>Linear Regression</p></li><li><p>and much more!</p></li></ul><p>Enroll today and we'll see you inside the course!</p><p>Krista and Jose</p>",
        "slug": "/course/math-for-data-science-masterclass/",
        "author": "Jose Portilla",
        "price": "72.04",
        "description": "Learn about probability, statistics, and more using the mathematics that are foundational to the field of data science.",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Artificial Intelligence",
        "subcategory": ["Data Science"],
        "date": "2022-08-24T19:51:54Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e922"
        },
        "name": "MERN Stack Real Time Chat App - React , Node , Socket IO",
        "img": "https://img-c.udemycdn.com/course/480x270/5015910_2a41_2.jpg",
        "details": "<p>Hi Guys, Welcome to the course '<strong>MERN Stack&nbsp; Real Time Chat Application'</strong></p><p><strong>In this course, you will learn the following topics</strong></p><p><br></p><ul><li><p>Building full-stack real-world applications from scratch</p></li><li><p>Working with complex MongoDB, queries, schemas, models</p></li><li><p>Working with Socket IO</p></li><li><p>Detailed explanation about Socket IO</p></li><li><p>One-to-one conservation</p></li><li><p>Real-time messaging with the socket rooms</p></li><li><p>Get the user's online status and activity</p></li><li><p>Get real-time notifications for messages</p></li><li><p>Read receipts and clear unread messages after reading.</p></li><li><p>Typing animation on the receiver side when the sender starts typing the message.</p></li><li><p>Storing all the messages and chats data in Mongo dB</p></li><li><p>Pushing Code to GitHub,</p></li><li><p>Hosting application in Heroku</p></li><li><p>24/7 Q/A Support.</p></li></ul><p><strong>MERN </strong>stands for MongoDB, Express, React, and Node, after the four key technologies that make up the stack.</p><ul><li><p>MongoDB - document database</p></li><li><p>Express(.js) - Node.js web framework</p></li><li><p>React(.js) - a client-side JavaScript framework</p></li><li><p>Node(.js) - the premier JavaScript web server</p></li></ul><p>Express and Node make up the middle (application) tier. Express.js is a server-side web framework and Node.js is the famous and powerful JavaScript server platform. Regardless of which variant you choose, ME(RVA)N is the ideal approach to working with JavaScript and JSON, all the way through.</p><p><strong>React </strong>is a free and open-source front-end JavaScript library for building user interfaces based on UI components. It is maintained by Meta and a community of individual developers and companies.</p><p><strong>Node.js</strong> is an open-source, cross-platform, back-end JavaScript runtime environment that runs on the V8 engine and executes JavaScript code outside a web browser designed to build scalable network applications. </p><p><br></p>",
        "slug": "/course/mern-stack-real-time-chat-app-react-node-socket-io/",
        "author": "K.Sathyaprakash Reddy",
        "price": "18.19",
        "description": "Build a Real Time Chat Application With React , Node , Socket IO",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["ReactJS", "NodeJS"],
        "date": "2022-12-08T16:13:52Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e923"
        },
        "name": "Modern MERN Stack | React Node Express MongoDB",
        "img": "https://img-b.udemycdn.com/course/480x270/4835930_d67c_4.jpg",
        "details": "<p>This is a complete MERN stack course that takes Javascript developers from novice to full stack engineers. We build an entire full stack application that covers all the foundations of the MERN stack so that students can truly be full stack developers. We start with the backend with creating a node project, then we incorporate express for our rest api framework. Then we connect to a real live Mongo database in the cloud. Our rest api includes password hashing with Bcrypt as well as handling json web tokens for authentication. We then move onto creating our React application with a beautiful interface using modern ui/ux principles. Lastly we use the most in demand state management technology, Redux, to help us manage state by sharing data received by the backend api with the different components in our application. This large project is meant to teach all the different technologies and bring them all together to build out a comprehensive and full stack application. By taking this course, students will be ready for senior level positions in Javascript as they have a deep intuition on how real world applications are build from front to back. Prior to taking this course, it is highly recommended to also take my React course since in that course I cover all the React basics such as components, routing and the basics of Redux. The purpose of this course is to help developers understand how to create a real world application using all these technologies so they have an intuition of how everything works from front to back.</p>",
        "slug": "/course/modern-mern-stack-react-node-express-mongodb/",
        "author": "Riaz Qureshi",
        "price": "18.19",
        "description": "Become A Full Stack Javascript Developer",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["ReactJS", "NodeJS"],
        "date": "2022-08-17T01:28:29Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e924"
        },
        "name": "Nodejs API Complete Guide Build a Blog Project API  2023",
        "img": "https://img-c.udemycdn.com/course/480x270/4980426_ee5d_4.jpg",
        "details": "<p>Nodejs API Complete Guide is your one stop solution to learning how to build a complete API using NodeJs, ExpressJs and MongoDB. In this course, we'll first start off by install the dependencies that we'll need for our project. Next, we'll set up our Express server and create our first API endpoint. From there, we'll connect to our MongoDB database and start creating blog posts. Finally, we'll finish up by creating an authentication system so that users can login and access their own blog posts. By the end of this course, you'll have a complete understanding of how to build a NodeJs API and will be able to build your own </p><p><br></p><p>This course is a complete guide to building a Nodejs API from scratch. We will first set up our development environment and then dive right into coding our API. We will build a complete blog application API, including routes, controllers, models, authentication, and file uploads. By the end of this course, you will have a strong understanding of how to build robust Nodejs APIs.</p><p><br></p><p>You don't need any previous experience in API development as this course is designed to take you through step by step</p><p>We will a explained in an easy to understand way with step by step instructions, video tutorials, and live examples. This is a hands-on course, where you get immediate access to every lesson,</p>",
        "slug": "/course/nodejs-api-complete-guide-by-building-blog-application-api/",
        "author": "i novotek Academy",
        "price": "18.19",
        "description": "Master Node JS by building a real-world RESTful API  (Blog API) with authentication, deployment API Documentation & more",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["NodeJS"],
        "date": "2022-11-16T09:49:09Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e925"
        },
        "name": "Node.js, Express, MongoDB & More: The Complete Bootcamp 2023",
        "img": "https://img-c.udemycdn.com/course/480x270/1672410_9ff1_5.jpg",
        "details": "<p>Do you want to build fast and powerful back-end applications with JavaScript? Would you like to become a more complete and in-demand developer?</p><p>Then Node.js is the hot technology for you to learn right now, and you came to the right place to do it!</p><p>Welcome to the Complete Node.js, Express, and MongoDB Bootcamp, your fast track to modern back-end development.</p><p><strong>This course is the perfect all-in-one package that will take you from a complete beginner to an advanced, highly-skilled Node.js developer.</strong></p><p>Like all my other courses, this one is completely project-based! And not just any project: it's a complete, beautiful, and feature-rich application, containing both a RESTful API and a server-side rendered website. It's the most fantastic and complete project that you will find in any Node.js course on the internet!</p><p><strong>By building this huge project, you will learn all the skills that you need in order to plan, build, and deploy your own modern back-end applications with Node.js and related technologies.</strong></p><p><em>(If you feel like exploring the project, you can do so at www[.]natours[.]dev. And this is only a small part of the project! Log in with \"laura@example.com\" and password \"test1234\")</em></p><p><br></p><p><strong>After finishing this course, you will:</strong></p><p><strong>1)</strong> Be building you own fast, scalable, and powerful Node.js RESTful APIs or web applications;</p><p><strong>2)</strong> Truly understand how Node.js works behind the scenes;</p><p><strong>3)</strong> Be able to work with NoSQL data and model data in real-world situations (a hugely important skill);</p><p><strong>4)</strong> Know how modern back-end development works, and how all the different technologies fit together (hard to understand from scattered tutorials and videos);</p><p><strong>5)</strong> Have experience in professionally-used tools and libraries like Express, Mongoose, Stripe, Sendgrid, Atlas, Compass, Git, Heroku, and many more;</p><p><strong>6)</strong> Have built a complete application, which is a perfect starting point for your own applications in the future.</p><p>Please note that this course is <strong>NOT</strong> for absolute web development beginners, so you should already be familiar with basic JavaScript. <strong>NO</strong> back-end experience required though!</p><p><br></p><p><strong>It's an absolutely full-packed, deep-dive course with over 40 hours of content!</strong></p><p>Since this is the \"Complete Node.js Bootcamp\", the course is crammed with tons of different technologies, techniques, and tools, so that you walk away from the course as a complete Node.js developer.</p><p>That's why the course turned out to be over 40 hours long. But if that sounds like too much for you, don't worry, there are videos or entire sections that you can safely skip.</p><p>Here is exactly what you're gonna learn:</p><ul><li><p>Fundamentals of Node.js, core modules, and NPM (Node Package Manager)</p></li><li><p>How Node.js works behind the scenes: event loop, blocking vs non-blocking code, event-driven architecture, streams, modules, etc.</p></li><li><p>Fundamentals of Express (Node.js framework): routing, middleware, sending responses, etc.</p></li><li><p>RESTful API design and development with advanced features: filtering, sorting, aliasing, pagination</p></li><li><p>Server-side website rendering (HTML) with Pug templates</p></li><li><p>CRUD operations with MongoDB database locally and on the Atlas platform (in the cloud)</p></li><li><p>Advanced MongoDB: geospatial queries, aggregation pipeline, and operators</p></li><li><p>Fundamentals of Mongoose (MongoDB JS driver): Data models, CRUD operations, data validation, and middleware</p></li><li><p>Advanced Mongoose features: modeling geospatial data, populates, virtual populates, indexes, etc.</p></li><li><p>Using the MVC (Model-View-Controller) architecture</p></li><li><p>How to work with data in NoSQL databases</p></li><li><p>Advanced data modelling: relationships between data, embedding, referencing, and more</p></li><li><p>Complete modern authentication with JWT: user sign up, log in, password reset, secure cookies, etc.</p></li><li><p>Authorization (user roles)</p></li><li><p>Security: best practices, encryption, sanitization, rate limiting, etc.</p></li><li><p>Accepting credit card payments with Stripe: Complete integration on the back-end and front-end</p></li><li><p>Uploading files and image processing</p></li><li><p>Sending emails with Mailtrap and Sendgrid</p></li><li><p>Advanced error handling workflows</p></li><li><p>Deploying Node.js application to production with Heroku</p></li><li><p>Git and GitHub crash course</p></li><li><p>And so much more!</p></li></ul><p><br></p><p><strong>Why should you learn Node.js and take this course?</strong></p><p>If you want to learn Node.js and modern back-end development, then there is no doubt that this course is for you!</p><p>It's the biggest Node.js course on the internet, it has by far the most complete course project, and offers the most in-depth explanations of all topics included.</p><p>And even if you already know some Node.js, you should still take this course, because it contains subjects that are not covered anywhere else, or not in the same depth!</p><p><em>But maybe you're not yet convinced that Node.js really is the right technology for you to learn right now?</em></p><p>Well, first, Node.js will allow you to use your JavaScript skills to build applications on the back-end. That itself is a huge gain, which makes your full-stack development process so much easier and faster.</p><p>Plus, popularity and opportunities for Node.js are off the charts. It's a modern, proven, and reliable technology, used by tech giants (and 6-figure-salary-paying-companies) like Netflix, PayPal, Uber, and many more.</p><p>Node.js really is what you should invest your time in, instead of outdated technology like PHP.</p><p>In summary, if you already know JavaScript, learning Node is the logical next step for you! <strong><em>It will make you a better, more versatile, and more complete developer, which will ultimately boost your opportunities in the job market!</em></strong></p><p><em>And I created this course to help you do exactly that! It really is the course I wish I had when I was first learning back-end development with Node.js and all related technologies.</em></p><p><br></p><p><strong>And this is what you get by signing up today:</strong></p><ul><li><p>Lifetime access to 40+ hours of&nbsp;HD quality videos. No monthly subscription. Learn at your own pace, whenever you want;</p></li><li><p>Friendly and fast support in the course Q&amp;A whenever you have questions or get stuck;</p></li><li><p>English closed captions (not the auto-generated ones provided by Udemy);</p></li><li><p>Course slides in PDF format;</p></li><li><p>Downloadable assets, starter code, and final code for each section;</p></li><li><p>Lots of small challenges are included in the videos so you can track your progress.</p></li></ul><p><br></p><p><strong>And now, I hope to welcome you as a new student in my course! So click that \"Enroll\" button right now, and join me in this adventure today!</strong></p><p>But if you're not 100% sure yet, just go ahead and watch the promo video to take a look at the course project. I promise you will be amazed :)</p><p><strong>See you in the course!</strong></p>",
        "slug": "/course/nodejs-express-mongodb-bootcamp/",
        "author": "Jonas Schmedtmann",
        "price": "105.96",
        "description": "Master Node by building a real-world RESTful API and web app (with authentication, Node.js security, payments & more)",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["NodeJS"],
        "date": "2018-05-02T11:35:16Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e926"
        },
        "name": "Python All In-One 2023 ™️ -Everything You'll Ever Need",
        "img": "https://img-c.udemycdn.com/course/480x270/4929652_63c4_8.jpg",
        "details": "<p>This course is<strong> Everything you will ever need</strong> to Master <strong>every detail </strong>of Python.</p><p>Are you looking to master Python from Basics all the way to Any Software Idea that comes up to your mind?</p><p>Then this is the right course for you. Because you will not only learn the basics of the language, but you will <strong>learn about all the other python supported packages along tens of Hands-On-Projects!</strong></p><p><strong>#Update 15.12.2022 Flutter For Python section was added (UI Web/Desktop Desing)<br>#Update 22.12.2022 SQL And Relational Databases was added (DB Basics and SQLAlchemy )</strong></p><p>Let this list of covered Topics give you an Idea:</p><p>1.Python Strings and RNG<br>2. Conditional Statements<br>3. Lists and Bundle Storage<br>4. Finite State Machines with Python<br>5. Loops <br>6. Functions<br>7. Dictionaries <br>8. Exceptions and Crash Handling <br>9. Python Built-In Functions<br>10. Object Oriented Programming<br>11. Decorators <br>12. Handling text Files<br>13. Handling&nbsp; Compressed Files<br>14. Data Plotting with Matplotlib<br>15. Directory Management.<br>16. Command Line Based Applications<br>17.&nbsp; Numpy and Math<br>18. Image Processing With OpenCV<br>19. Video Processing<br>20. Object Tracking<br>21.&nbsp; Pandas And Tabular Data<br>22. GUI Based Apps<br>23. Converting Python to Stand-Alone Software<br>24. Recommender Systems with Netflix<br>25. OCR and Image to Text Conversion<br>26. Data Analysis Breakdown<br>27. Artificial Data Generation<br>28. Machine Learning Breakdown<br>29. Features Engineering<br>30. Seaborn for Data Visualization <br>31. Gaussian Naive Bayes <br>32. Principal Component Analysis (PCA)&nbsp; <br>33. Linear Regression&nbsp; <br>34. Polynomial Regression&nbsp; <br>35. K-means Clustering&nbsp; <br>36. Support Vector Machine (SVM)&nbsp; <br>37. Linear Discriminate Analysis (LDA)&nbsp; <br>38. t-SNE&nbsp; <br>39. Hierarchical Clustering&nbsp; <br>40. Time Series Analysis&nbsp; <br>41. Decision Trees <br>42. Random Forests<br>43. Reinforcement Learning <br>44. Natural Language Processing (NLP)<br>45. Building A Messages and Emails Spam FIlter<br>46. Market Segmentation<br>47. Analyzing House Pricing<br>48. Deep learning Breakdown<br>49. Artificial Neural Networks <br>50. Image Classification <br>51. Convultional Neural Networks<br>52. Automating Accountant Job<br>53. Building Web Apps<br>54. Flutter For Python Using Flet<br>55. SQL and Relational Databases&nbsp;(Using SQLAlchemy)</p><p>And more!!!</p><p>See all of those concepts? Do you know the amount of people suffering to understand concepts like Machine Learning, Deep Learning and Data Analysis? it is actually very large.<strong> But this won't be the case if you take this course!</strong><br><strong>They will be broken down to very simple terms,<br>Like explaining to a 5 years old how algorithms works!</strong> </p><p>Start now an lay a job in one of the hottest Programming language in the market now!</p><p>Because of the high diversity of topics in this course, this will be the only Python Course you will need to build any Python Software.</p><p>Plus I will be you mentor, so you can ask me any question any time and I will be more than happy to guide you through!</p><p><br></p><p><br></p>",
        "slug": "/course/python-the-ultimate-course-2023-everything-youll-ever-need/",
        "author": "Mouhammad Hamsho",
        "price": "63.56",
        "description": "Python Ultimate  Bootcamp : Basics, GUI, Data Science, Deep Learning, Automation, Image Processing, Games, And Web Apps",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Artificial Intelligence",
        "subcategory": ["Python"],
        "date": "2022-10-15T08:44:25Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e927"
        },
        "name": "React JS from Zero to Hero",
        "img": "https://img-c.udemycdn.com/course/480x270/4956178_557e_2.jpg",
        "details": "<p>This course will provide a series of nine classes in which all basic ReactJS concepts will be explored with one goal in mind: to re-create a project that has been shown in the very beginning of the course. The students will be able to engage in an purpose-driven learning process with fast yet understandable classes guided by a practical project which should make students aim at an attainable yet exciting goal. The course will not require any previous knowledge either of HTML, CSS or Javascript, even though some programming experience and familiarity with things such as functions and return values would be welcome, they are not utterly necessary for the undertaking of the classes and its utmost grasping. The classes will be delivered in a structured way, providing ease of reusability in any situation in which it might prove necessary. The course takes theory and practice hand in hand and applies them together from the very beggining, with challenges along the way which will greatly increase the engagement of the student with the course and its overall understanding and grasping. One who is to enroll this course should expect a basic understanding of the most important and essential React JS rules and concepts as to in the end of it be able to think about React JS, reason with its tools and think about solutions for new problems. Of course such ability does not come within three hours of classes, but the tools are given and the table is set for the formation of a truly capable developer when added to his/her own experience.</p>",
        "slug": "/course/react-js-from-zero-to-hero/",
        "author": "Elias Rodrigo Rosa",
        "price": "18.19",
        "description": "Learn React JS without prior web development experience with a detailed and hands-on course.",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["ReactJS"],
        "date": "2022-11-01T13:29:41Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e928"
        },
        "name": "React Native - The Practical Guide [2023]",
        "img": "https://img-c.udemycdn.com/course/480x270/1436092_2024_4.jpg",
        "details": "<p><strong>This course was updated (completely re-recorded) in April 2022 - you learn the latest version of React Native with this course!</strong></p><p>---</p><p><strong>Mobile apps</strong>&nbsp;are one of the best ways to engage with users - no wonder everyone wants to build one!</p><p>Wouldn't it be great if you could use your&nbsp;<strong>web development knowledge</strong>, combined with your&nbsp;<strong>React</strong>&nbsp;knowledge, to&nbsp;<strong>build mobile apps</strong>&nbsp;with that?</p><p><strong>That's exactly what React Native allows you to do!</strong></p><p>No need&nbsp;to learn Java, Android, Swift, ObjectiveC or anything of that -&nbsp;<strong>React and JavaScript is all you need&nbsp;</strong>to create awesome native mobile apps that work on both Android and iOS. That's probably the reason why Instagram, AirBnB,&nbsp;Skype and many other global companies&nbsp;are using it to build their mobile apps!</p><p>With this course, you can join this league. I'll teach you all you need to create your own React Native apps, publish them to the Google Play Store and Apple App Store and dive really deep into the React Native ecosystem.</p><p>You'll learn all about the theory behind React Native, its core concepts, how to build responsive designs that work on different device sizes, how to navigate around, use maps and the camera and so much more!</p><p>And which better way to learn&nbsp;than by&nbsp;<strong>building a real app?</strong>&nbsp;We'll build the \"<strong>Favorite Places</strong>\"&nbsp;app in this course, an app where users can share amazing pictures and the location where they took them. This app will allow you to see things like using maps, the camera, user authentication, connecting to a server and much more in action.</p><p>By the end of the course, we'll of course also go through all steps required to get it into an app store.</p><p><strong>Here's a detailed look at what you'll get:</strong></p><ul><li><p>The core concepts and theory</p></li><li><p>How to use React, JavaScript and native components</p></li><li><p>Understand how to navigate in React Native apps</p></li><li><p>A closer look at styling and animating React Native apps</p></li><li><p>Instructions on how to use third-party libraries in your React Native app</p></li><li><p>Detailed examples on how to use maps or an image picker</p></li><li><p>A full user authentication flow</p></li><li><p>How to connect to a backend server from your app</p></li><li><p>Debugging instructions</p></li><li><p>And so much more!</p></li></ul><p><strong>What will you need to succeed in this course?</strong></p><ul><li><p>NO&nbsp;Android, Java, Swift or ObjectiveC knowledge is required!</p></li><li><p>JavaScript and React (for the web) knowledge is required though - you don't need to be an expert but the basics need to be set (though there are refresher sections in this course!)</p></li></ul><p>I'd be very happy to welcome you in the course!</p><p>Max</p>",
        "slug": "/course/react-native-the-practical-guide/",
        "author": "Academind by Maximilian Schwarzmüller",
        "price": "84.76",
        "description": "Use React Native and your React knowledge to build native iOS and Android Apps - incl. Push Notifications, Hooks, Redux",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Mobile Development",
        "subcategory": ["React Native"],
        "date": "2017-11-16T22:32:01Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e929"
        },
        "name": "React - The Complete Guide (incl Hooks, React Router, Redux)",
        "img": "https://img-c.udemycdn.com/course/480x270/1362070_b9a1_2.jpg",
        "details": "<p><strong>This course is fully up-to-date with React 18 (the latest version of React)!</strong></p><p><strong>It was completely updated and re-recorded from the ground up - it teaches the very latest version of React with all the core, modern features you need to know!</strong></p><p>---</p><p>This course also comes with <strong>two paths</strong> which you can take:&nbsp;The <strong>\"complete\"&nbsp;path</strong> (full &gt;40h course) and the <strong>\"summary\"&nbsp;path</strong> (~4h summary module) - you can choose the path that best fits your time requirements!&nbsp;:-)</p><p>---</p><p>React.js is <strong>THE most popular JavaScript library</strong> you can use and learn these days to build modern, reactive user interfaces for the web.</p><p>This course teaches you React in-depth, <strong>from the ground up</strong>, step by step by diving into all the core basics, exploring tons of examples and also introducing you to advanced concepts as well.</p><p>You'll get <strong>all the theory, tons of examples and demos, assignments and exercises and tons of important knowledge</strong> that is skipped by most other resources - after all, there is a reason why this course is that huge! :)</p><p>And in case you don't even know why you would want to learn React and you're just here because of some ad or \"the algorithm\" - no worries: ReactJS is a key technology as a web developer and <strong>in this course I will also explain WHY it's that important</strong>!</p><p><br></p><p><strong>Welcome to \"React - The Complete Guide\"!</strong></p><p>This course will teach you React.js in a practice-oriented way, using all the latest patterns and best practices you need. You will learn all the key fundamentals as well as advanced concepts and related topics to turn you into a React.js developer.</p><p>This is a huge course because <strong>it really covers EVERYTHING you need to know and learn to become a React.js developer!</strong></p><p>No matter if you <strong>know nothing about React</strong> or if you already <strong>got some basic React knowledge</strong> (not required but also not a problem), you will get <strong>tons of useful information and knowledge out of this course</strong>!</p><p>My goal with this course is to ensure that you feel confident working with React, so that you can apply for React jobs, use it in your own projects or simply enhance your portfolio as a developer - whatever your goal is: This course gets you there!</p><p><br></p><p>I originally created this course in 2017 and I have kept it updated since that - <strong>redoing it from the ground up in 2021</strong>. And of course I'm dedicated to keeping this course up-to-date - so that you can rely on this course to learn React in the best possible way!</p><p><strong>What's in this course?</strong></p><ul><li><p>A thorough introduction to React.js (What is it and why would you use it?)</p></li><li><p>All the core basics: How React works, building components with React &amp; building UIs with React</p></li><li><p>Components, props &amp; dynamic data binding</p></li><li><p>Working with user events and state to create interactive applications</p></li><li><p>A (thorough) look behind the scenes to understand how React works under the hood</p></li><li><p>Detailed explanations on how to work with lists and conditional content</p></li><li><p>React Hooks (in-depth)!</p></li><li><p>Working with built-in Hooks and building custom Hooks</p></li><li><p>How to debug React apps</p></li><li><p>Styling React apps with \"Styled Components\" and \"CSS Modules\"</p></li><li><p>Working with \"Fragments\" &amp; \"Portals\"</p></li><li><p>Dealing with side effects</p></li><li><p>Class-based components and functional components</p></li><li><p>Sending Http requests &amp; handling transitional states + responses</p></li><li><p>Handling forms and user input (incl. validation)</p></li><li><p>Redux &amp; Redux Toolkit</p></li><li><p>Routing with React Router</p></li><li><p>An in-depth introduction into Next.js</p></li><li><p>Deploying React Apps</p></li><li><p>Implementing Authentication</p></li><li><p>Unit Tests</p></li><li><p>Combining React with TypeScript</p></li><li><p>Adding Animations</p></li><li><p>Tons of examples and demo projects so that you can apply all the things you learned in real projects</p></li><li><p>And so much more - check out the full curriculum on this page!</p></li></ul><p>This really is the \"Complete Guide\" - promised!</p><p>And best of all?</p><p><strong>You don't need any prior React knowledge!</strong></p><p>This course starts with zero knowledge assumed! <strong>All you need is basic web development and JavaScript knowledge</strong> (though the course even <strong>includes a brief JavaScript refresher</strong> to ensure that we're all on the same page!).</p><p><strong>Check out the full curriculum, the free preview videos and join the course risk-free thanks to the 30-day money-back guarantee!</strong></p>",
        "slug": "/course/react-the-complete-guide-incl-redux/",
        "author": "Academind by Maximilian Schwarzmüller",
        "price": "101.72",
        "description": "Dive in and learn React.js from scratch! Learn Reactjs, Hooks, Redux, React Routing, Animations, Next.js and way more!",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["ReactJS"],
        "date": "2017-09-26T22:20:24Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e92a"
        },
        "name": "The Complete JavaScript Course 2023: From Zero to Expert!",
        "img": "https://img-c.udemycdn.com/course/480x270/851712_fc61_6.jpg",
        "details": "<p><strong><em>***&nbsp;The #1 bestselling JavaScript&nbsp;course on Udemy! ***</em></strong></p><p><strong><em>*** Just updated for latest ES2021 and ES2022 features ***</em></strong></p><p><em>\"Really, really well made course. Super in-depth, with great challenges and projects that will solidify your Javascript understanding. I found the lectures were paced perfectly -- Jonas doesn't skip over anything that might be useful to a JS developer\"</em> — Carson Bartholomew</p><p><br></p><p>JavaScript is the most popular programming language in the world. It powers the entire modern web. It provides millions of high-paying jobs all over the world.</p><p>That's why you want to learn JavaScript too. And you came to the right place!</p><p><br></p><p><strong>Why is this the right JavaScript course for you?</strong></p><p><em>This is the most complete and in-depth JavaScript course on Udemy (and maybe the entire internet!). It's an all-in-one package that will take you from the very fundamentals of JavaScript, all the way to building modern and complex applications.</em></p><p>You will learn modern JavaScript from the very beginning, step-by-step. I will guide you through <strong>practical and fun code examples</strong>, <strong>important theory</strong> about how JavaScript works behind the scenes, and <strong>beautiful and complete projects</strong>.</p><p>You will become ready to continue learning advanced <strong>front-end frameworks</strong> like React, Vue, Angular, or Svelte.</p><p>You will also learn how to think like a developer, how to plan application features, how to architect your code, how to debug code, and a lot of other real-world skills that you will need on your developer job.</p><p>And unlike other courses, this one actually contains beginner, intermediate, advanced, and even expert topics, so <strong>you don't have to buy any other course in order to master JavaScript</strong> from the ground up!</p><p>But... You don't have to go into all these topics. This is a huge course, because, after all, it's \"The Complete JavaScript Course\". In fact, it's like many courses in one! <strong>But you can become an excellent developer by watching only parts of the course</strong>. That's why I built this course in a very modular way, and designed pathways that will take you through the course faster.</p><p><em>By the end of the course, you will have the knowledge and confidence that you need in order to ace your job interviews and become a professional developer.</em></p><p><br></p><p><strong>Why am I the right JavaScript teacher for you?</strong></p><p>My name is Jonas, I'm an experienced web developer and designer, and one of Udemy's top instructors. I have been teaching this bestselling course since 2016 to over 700,000 developers, always listening to feedback and understanding exactly how students actually learn.</p><p>I know how students learn JavaScript and what they need in order to master it. And with that knowledge, I designed the ideal course curriculum. <strong>It's a unique blend of real-world projects, deep explanations, theory lectures, and challenges</strong>, that will take you from zero to an expert and confident JavaScript developer in just a couple of weeks.</p><p><br></p><p><strong>So what exactly is covered in the course?</strong></p><ul><li><p>Build 5 beautiful real-world projects for your portfolio! In these projects, you will learn how to plan and architect your applications using flowcharts and common JavaScript patterns</p></li><li><p>Master the JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, and more</p></li><li><p>Learn modern JavaScript (ES6+) from the beginning: arrow functions, destructuring, spread operator, default arguments, optional chaining, and more</p></li><li><p>How JavaScript works behind the scenes: engines, the call stack, hoisting, scoping, the 'this' keyword, reference values, and more.</p></li><li><p>Deep dive into functions: arrow functions, first-class and higher-order functions, bind, and closures.</p></li><li><p>Deep dive into object-oriented programming: prototypal inheritance, constructor functions (ES5), classes (ES6), encapsulation, abstraction, inheritance, and polymorphism. [This is like a small standalone course]</p></li><li><p>Deep dive into asynchronous JavaScript: the event loop, promises, async/await, and error handling. You will use these to access data from third-party APIs with AJAX calls. [This is like a small standalone course]</p></li><li><p>Learn modern tools that are used by professional web developers: NPM, Parcel (module bundler), Babel, and ES6 modules</p></li></ul><p>Check out the course curriculum for an even more detailed overview of the content :)</p><p><br></p><p><strong>This is what's also included in the package:</strong></p><ul><li><p>Up-to-date HD-quality videos, that are easy to search and reference (<em>great for Udemy Business students</em>)</p></li><li><p>Professional English captions (not the&nbsp;auto-generated ones)</p></li><li><p>Downloadable starter code and final code for each section</p></li><li><p>Downloadable slides for 40+ theory videos (not boring, I promise!)</p></li><li><p>Free support in the course Q&amp;A</p></li><li><p>25+ coding challenges and 25+ assignments to practice your new skills (solutions included)</p></li></ul><p><br></p><p><strong>This course is for you if...</strong></p><ul><li><p>... you want to gain a true and deep understanding of JavaScript</p></li><li><p>... you have been trying to learn JavaScript but: 1) still don't really understand JavaScript, or 2) still don't feel confident to code real apps</p></li><li><p>... you are interested in using a library/framework like React, Angular, Vue, or Node.js in the future</p></li><li><p>... you already know JavaScript and are looking for an advanced course. This course includes expert topics!</p></li><li><p>... you want to get started with programming: JavaScript is a great first language!</p></li></ul><p><br></p><p><strong>Does any of these look like you? If so, then start this adventure today, and join me and 700,000+ other developers in the only JavaScript course that you will&nbsp;ever need!</strong></p>",
        "slug": "/course/the-complete-javascript-course/",
        "author": "Jonas Schmedtmann",
        "price": "93.24",
        "description": "The modern JavaScript course for everyone! Master JavaScript with projects, challenges and theory. Many courses in one!",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Development",
        "subcategory": "Web Development",
        "date": "2016-05-17T09:31:26Z",
        "lectures": {
            "total": 0,
            "duration": "",
            "sections": [
                {
                    "title": "",
                    "total": 0,
                    "duration": "",
                    "lessons": [
                        {
                            "title": "",
                            "resourses": "",
                            "video": ""
                        }
                    ]
                }
            ]
        }
    },
    {
        "_id": {
            "$oid": "63a8185d77cf7f9d1134e92b"
        },
        "name": "The Complete 2023 Web Development Bootcamp",
        "img": "https://img-c.udemycdn.com/course/480x270/1565838_e54e_16.jpg",
        "details": "<p>Welcome to the Complete Web Development Bootcamp,<strong> the only course you need</strong> to learn to code and become a full-stack web developer. With 150,000+ ratings and a 4.8 average, my Web Development course is one of the HIGHEST&nbsp;RATED courses in the history of Udemy!&nbsp;</p><p>At 65+ hours, this Web Development course is without a doubt the <strong>most comprehensive </strong>web development course available online. Even if you have <strong>zero</strong> programming experience, this course will take you from <strong>beginner to mastery</strong>. Here's why:</p><ul><li><p>The course is taught by the <strong>lead instructor</strong> at the App Brewery, London's <strong>leading in-person programming bootcamp</strong>.</p></li><li><p>The course has been updated to be <strong>2023 ready </strong>and you'll be learning the latest tools and technologies used at large companies such as Apple, Google and Netflix.</p></li><li><p>This course doesn't cut any corners, there are beautiful <strong>animated explanation videos</strong> and tens of <strong>real-world projects</strong> which you will get to build.</p></li><li><p>The curriculum was developed over a period of <strong>four years</strong>, with comprehensive student testing and feedback.</p></li><li><p>We've taught over a <strong>million</strong> students how to code and many have gone on to <strong>change their lives </strong>by becoming professional developers or starting their own tech startup.</p></li><li><p>You'll save yourself <strong>over $12,000 </strong>by enrolling, but still get access to the same teaching materials and learn from the same instructor and curriculum as our in-person programming bootcamp.</p></li><li><p>The course is <strong>constantly updated</strong> with new content, with new projects and modules determined by students - that's you!</p></li></ul><p><br></p><p>We'll take you <strong>step-by-step</strong> through engaging video tutorials and teach you everything you need to know to succeed as a web developer.</p><p>The course includes over <strong>65 hours</strong> of HD video tutorials and builds your programming knowledge while making real-world websites and web apps.</p><p><br></p><p>Throughout this comprehensive course, we cover a massive amount of tools and technologies, including:</p><ul><li><p>Front-End Web Development</p></li><li><p><strong>HTML</strong> 5</p></li><li><p><strong>CSS</strong> 3</p></li><li><p><strong>Bootstrap</strong> 4</p></li><li><p><strong>Javascript</strong> ES6</p></li><li><p>DOM Manipulation</p></li><li><p><strong>jQuery</strong></p></li><li><p>Bash Command Line</p></li><li><p>Git, <strong>GitHub</strong> and Version Control</p></li><li><p>Backend Web Development</p></li><li><p><strong>Node</strong>.js</p></li><li><p>NPM</p></li><li><p><strong>Express</strong>.js</p></li><li><p>EJS</p></li><li><p>REST</p></li><li><p><strong>APIs</strong></p></li><li><p>Databases</p></li><li><p>SQL</p></li><li><p><strong>MongoDB</strong></p></li><li><p>Mongoose</p></li><li><p>Authentication</p></li><li><p>Firebase</p></li><li><p><strong>React</strong>.js</p></li><li><p>React Hooks</p></li><li><p>Web Design</p></li><li><p>Deployment with GitHub Pages, Heroku and MongoDB&nbsp;Atlas</p></li><li><p>Web3 Development on the Internet Computer</p></li><li><p>Blockchain technology</p></li><li><p>Token contract development</p></li><li><p>NFT minting, buying and selling logic</p></li></ul><p>By the end of this course, you will be <strong>fluently</strong> programming&nbsp;and be ready to <strong>make any website you can dream of.</strong></p><p>You'll also build a <strong>portfolio</strong> of over 32+ websites that you can <strong>show off</strong> to any potential employer.</p><p><strong>Sign up today, and look forward to:</strong></p><ul><li><p>Animated Video Lectures</p></li><li><p>Code Challenges and Coding Exercises</p></li><li><p>Beautiful Real-World Projects</p></li><li><p>Quizzes &amp; Practice Tests</p></li><li><p>Downloadable Programming Resources and Cheatsheets</p></li><li><p>Our best selling 12 Rules to Learn to Code eBook</p></li><li><p>$12,000+&nbsp;worth of web development bootcamp&nbsp;course materials and course curriculum</p></li></ul><p><br></p><p>Don't just take my word for it, check out what existing students have to say about the course:</p><p>\"Angela is just incredible, awesome and just fantastic in this course. I've never had such an instructor; <strong>detailed</strong> in every aspect of the course, gives precise explanations, gives you the anxiety to learn etc. She's got that ability to make fun while explaining things for better understanding. I really love this course.\" - Ekeu MonkamUlrich</p><p>\"Angela is very thorough without ever being boring. I've taken MANY online courses in my life including my Bachelors and Masters degrees. She is by far the best instructor I've ever had. This course is <strong>packed with thousands of dollars worth of great instruction</strong>, and paced well enough for anyone to pick coding up and run with it- Thank you!\" - J Carlucci</p><p>\"Love the way Angela explains things. Easy to follow and full of logic. I can say she must have spent a lot of energy creating this great course. Thank you and I recommend it to all who's interested in coding!\" - Yiqing Zheng</p><p>\"So far (on my third day) this course has taught me <strong>more than I was able to learn in multiple other programming courses</strong>. This course is clearly outlined and builds upon itself gradually in an easy to understand way.\" - Normal Ramsey</p><p>\"This course will take you from beginner to intermediate level for real. If you don't know how to put together the pieces of web development this is what you're looking for. Angela explains in an amazing way by <strong>creating projects</strong> all the way during this course, explaining the concepts in real practice. Thank you very much, Angela. I will always consider you my mentor. Look forward to taking more courses with you.\" - Moises Dionisio Cruz</p><p>\"An amazing course, perfect for absolute beginners at the start of their coding journey! Angela is an amazing tutor and can explain in the most simple and comprehensible way even complex coding notions.<strong> Learning web development cannot get any more fun!</strong>\" - Zoe Moyssoglou</p><p>\"It's a different approach to teaching Web Development. I like that you are <strong>given everything possible to succeed</strong> from the onset.\" - Ronick Thomas</p><p>The tutor is simply AMAZING, by far the best tutor I have ever had. I would give her 10 stars out of 5. She is not just punching the code and talking to herself, but she is actually explaining things. She keeps on giving really useful hints and she will give you a great load of other references. I always knew what I was doing and why I was doing it. All the extra challenges have just made me remember and understand things better. - Peter Dlugos</p><p><br></p><p><br></p><p><strong>REMEMBER… I'm so confident that you'll love this course that&nbsp;we're offering a FULL money-back guarantee for&nbsp;30 days! So it's a complete no-brainer, sign up today with ZERO&nbsp;risk and EVERYTHING to gain.</strong></p><p>So what are you waiting for?&nbsp;Click the buy now button and join the world's highest-rated web development course.</p>",
        "slug": "/course/the-complete-web-development-bootcamp/",
        "author": "Dr. Angela Yu",
        "price": "105.96",
        "description": "Become a Full-Stack Web Developer with just ONE course. HTML, CSS, Javascript, Node, React, MongoDB, Web3 and DApps",
        "currency": "USD",
        "sale": 0,
        "finish": 1,
        "category": "Web Development",
        "subcategory": ["HTML", "CSS", "Javascript"],
        "date": "2018-02-22T12:02:33Z"
    }
]
