{"viewer":94528,"avg_rating":4.7,"num_reviews":15477,"course_id":"63a8185d77cf7f9d1134e925","reviews":[{"content":"<p>Really appreciate Jonas to make this tutorial. As Beginner  for node js this tutorial is very helpful to get clear on node js, express js and also mongo BD. Really happy with this tutorial .</p>","rating":5,"created":"2022-11-24T03:38:33-08:00","like":0,"dislike":10,"user":{"name":"Nikhil Sompura","avatar":"https://img-b.udemycdn.com/user/50x50/211415808_8895.jpg"}},{"content":"<p>The course is better than I expected. However, there are many node packages were out of date that cause me some time to figure out the proper syntax to use.</p>","rating":4.5,"created":"2022-11-16T20:25:44-08:00","like":32,"dislike":1,"user":{"name":"William Tran","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Awesome! I’ve just completed the whole course and it is amazing. Certainly there are some lectures that need to be updated because there have been a lot of changes since they were recorded. However, finding the way through these (not planned) challenges have probe to be a great learning experience and most of all this is the closest you will get to face real life web dev challenges. Totally recommended!</p>","rating":5,"created":"2022-10-26T13:16:57-07:00","like":72,"dislike":2,"user":{"name":"César Muñoz","avatar":"https://img-b.udemycdn.com/user/50x50/14973028_154e.jpg"}},{"content":"<p>I’ve seen lots of tutorials but I haven’t seen any that interest me enough to want to see the end even when it’s so long. It’s detailed and good for beginners</p>","rating":5,"created":"2022-10-24T01:00:32-07:00","like":59,"dislike":8,"user":{"name":"TheAfricanDREAM Network","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I love all Jonas' courses. Great teacher who always takes the time to explain how things work under the hood, which is great for mastering the fundamentals.</p>","rating":5,"created":"2022-09-16T08:00:43-07:00","like":22,"dislike":1,"user":{"name":"Peter Faucella","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course is totally abandoned. </p>\n\n<p>The latest replies I've seen from Jonas or any of the tutors are like 2 years old.</p>\n\n<p>Jonas is REALLY bad at naming stuff and commenting his code. Also, he is really lazy: makes many mistakes in some videos and, instead of recording them again, he just tries to go around it by creating notes. I would not mind if these mistakes were rare, but they are everywhere.</p>\n\n<p>Jonas is far from being a good developer and even farther from being a good teacher.</p>\n\n<p>I definitely do not recommend this course.</p>","rating":1,"created":"2022-12-04T13:43:57-08:00","like":34,"dislike":3,"user":{"name":"Henriquebzn","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Jonas is a good teacher, but this course is deprecated and yet it is advertised as for 2023.  This is not honest advertising, as it's become very clear by looking at the comments on sections where I ran into major issues because things simply weren't working the same way as the instructor showed, that many of these lessons are at least 2 years old, and seemingly more than that.  Beyond that, the course material is organized in a different file structure than Jonas', which has led to hours of frustration.  That being said, the course is more in depth than you find most places, and covers really a lot of material.  I can't say it wasn't worth the purchase, but I really think this needs some work, and the labeling is not good.</p>","rating":3,"created":"2022-11-26T14:13:57-08:00","like":57,"dislike":4,"user":{"name":"Riparian","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course was great in getting my feet wet with node.js backend development.</p>\n\n<p>Points for improvement would be:<br>1. Better solution for constant refactoring and still wanting to keep old code/comments for reference without file becoming a hot mess.<br>2. Adding two-factor authentication as a baseline (with sync) as most places use it nowadays.<br>3. Discuss Google/Facebook APIs etc. for signing user up since they are very commonplace.</p>","rating":4.5,"created":"2022-11-19T13:13:12-08:00","like":28,"dislike":7,"user":{"name":"Dave Phillips","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>As an experienced developer with some experience in Node.js I was still able to learn a lot in this course and took my skills to the next level. Thanks to Jonas, I am now able to realize the project ideas I already had in mind: secure, fast and scaleable applications will no be a problem anymore!</p>","rating":4.5,"created":"2022-12-19T20:25:31-08:00","like":74,"dislike":7,"user":{"name":"Jason Bladt","avatar":"https://img-b.udemycdn.com/user/50x50/30478040_73a1.jpg"}},{"content":"<p>I signed up for this course 3 years after it was offered. In computer years that would be akin to using Snow Leopard or Windows 98. Once I tried implementing Mapbox and Stripe, everything flew out the window. Errors after errors. Bad request, cross-origin problems, can't create a Stripe Session, etc. It is very frustrating to spend 70-80 hours following along with an app taught by an excellent instructor only to see it fail at the finish line. I have purchased many Udemy courses and on a whole they have all be great and a bargain at any price. Jonad knows his s@@t better than anyone else on the platform. My critique is more about web-development in general than the course or instructor. Imagine the English or French language changing every 18 months. How would we communicate with anyone? It's Babel in the true sense of the word. Three years ago the app worked and students were satisfied. But for a new coder in 2022, taking a web development course will require an equally long JEST debugging class because nothing works as expected. This is like college before auto-save was a word function. You'd spend hours on a thesis, term paper, what have you. Have a momentary power surge and everything you worked on was lost. Web development, React, Next,  Redux, Python, these are all unique and syntax specific computer programming languages. Forget to close a template literal or miss a comma and your work crashes. I learned many things but not how to fix the never ending list of JS errors. I have been invited to the restaurant, shown the menu, but not allowed to eat. M</p>","rating":4.5,"created":"2022-11-10T02:30:39-08:00","like":97,"dislike":4,"user":{"name":"Martin Dixon","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I am really disappointed. The content desperately needs to be updated. Many of the sections shows things that are outdated. Too many issues with the code, a lot of deprecated things.</p>","rating":2,"created":"2022-11-16T03:58:35-08:00","like":16,"dislike":4,"user":{"name":"Dimo Dimov","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Great course.<br>The only problem -> One giant project with no mini-do-it-yourself sections <br>So for me it was just to copy & paste what jonas said and try to understand.</p>\n\n<p>In the javaScript course there was a lot of challenges and mini-do-it-yourself sections so the learning curve was much better.</p>","rating":4,"created":"2022-12-15T09:17:10-08:00","like":57,"dislike":3,"user":{"name":"Yotam Lin","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I completed the course using Typescript. This is one of those courses that has so much good information, you will probably review it many times as you build your own projects. Thanks Jonas! Great course!<br>Bryon</p>","rating":5,"created":"2022-11-25T13:17:05-08:00","like":97,"dislike":5,"user":{"name":"Bryon Smith","avatar":"https://img-b.udemycdn.com/user/50x50/12782246_ef25_5.jpg"}},{"content":"<p>Till section 12 everything was good as the last course I took with Jonas. But from this definitely has not been updated since 2019 and mostly does not work with the way that Jonas code</p>","rating":2.5,"created":"2022-11-30T08:12:17-08:00","like":50,"dislike":9,"user":{"name":"Dor Bezalel","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Deeply intense course. I got lost quite a few times and it was frustrating but the reward was learning how to solve problems. Admittedly, I leaned heavily on the Q&A sections to get the answer. For the most part, my fellow classmates provided some great solutions that I could actually learn from. I actually like it this way so that I'm not being spoon-fed the answer. This course really made me think. <br>Thanks Jonas</p>","rating":5,"created":"2022-10-13T13:20:30-07:00","like":92,"dislike":6,"user":{"name":"Charles Evelyn","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Coming from non IT background, It was quite challenging initially but I trust Jonas and team blindly and guess what I have become more confident in web-development, improved my logic building and many more things. Every bit of this course is very well explained and implemented thoroughly. Thank you so much Jonas and team for your time and effort. It really means a lot to me.</p>","rating":5,"created":"2022-09-25T04:43:47-07:00","like":79,"dislike":5,"user":{"name":"Kamlesh Lohar","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Wow, seriously.  I learned so much in this course.  I've taken all of Jonas' courses and have been impressed in each one.  I look forward to more current technologies, hopefully he releases more soon.</p>","rating":5,"created":"2022-10-23T17:30:32-07:00","like":61,"dislike":1,"user":{"name":"Larry Gray","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Really honest review:  I have completed the course and it wasn't easy tbh. I have taken other courses of Jonas before this and they were too good. Now I am not sure if I can say that for this one because I am sure Jonas is good teacher, and you get to learn a lot of things in this course. The only issue why I gave 3.5/5 is the course needs to be updated. There were so many places in between the course where Jonas's code wasn't working for me (because of the changes in packages in updates) and I wasted so much hours trying to fix them. It was really frustrating tbh. Also QnA section is dead, Assistants don't reply to our queries, thanks to students who are there to help, they are saving so much of our time. So I will say it's high time now Jonas should update his course, it's been 3 years, there are so many bugs in the course.</p>","rating":3.5,"created":"2022-08-11T01:12:29-07:00","like":73,"dislike":7,"user":{"name":"Lovish Kamboj","avatar":"https://img-b.udemycdn.com/user/50x50/78626146_0725.jpg"}},{"content":"<p>This SHOULD be a 5 star course, the project is interesting, the instructor is relatively easy to follow (though jumping around within the code having just typed a line you are trying to keep up with an understand is not helpful) and in terms of difficulty it has a good learning curve from basics to advanced.</p>\n\n<p>However, it is severely let down by the age of the software versions, often using major versions many numbers out of date and with it the entire syntax becoming deprecated in places. To say that this was a headache is putting it mildly.</p>\n\n<p>A students job during these courses is to understand the processes and functions being implemented, but having student tied in knots to make simple functions work is counter-productive.</p>\n\n<p>There are students with questions 2 years or older in the Q&A that are left unanswered and those being responded to would really have helped smooth out a lot of these issues. </p>\n\n<p>All in all I am glad to have this one out of the way but now feel like I need to find another course in order to see just how much has sunk in as expected in areas where I felt like I was putting out fires to make the code work.</p>","rating":2,"created":"2022-10-21T04:13:48-07:00","like":39,"dislike":5,"user":{"name":"Leigh Godson","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I have taken Jonas JS course and it was pretty good which led me to purchase this course. However, this course is very frustrating. Even if you follow the code very closely, the code doesn't work. This course is like sitting beside somebody writing a program and mumbling along as he is coding.</p>","rating":1.5,"created":"2022-10-17T12:14:41-07:00","like":90,"dislike":5,"user":{"name":"Ken Tan","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}}]}