{"viewer":42491,"avg_rating":4.7,"num_reviews":5713,"course_id":"63a9e958115c6e459c01ad74","reviews":[{"content":"<p>Ha cumplido perfectamente con mis expectativas. Presenta una visión completa y detallada  de todos los aspectos de TensorFlow documentados con ejemplos prácticos y perfectamente explicados y de forma muy amena por el formador.</p>","rating":4.5,"created":"2022-12-16T00:31:33-08:00","like":52,"dislike":4,"user":{"name":"Jose Angel Henales Garcia","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This is a great course for those who want to get hands on in Neural Networks (with TensorFlow). This is a great course for beginners and intermediate, almost everything was covered briefly (even deep understanding of various objects). Definitely much more value than money. I am completely satisfied and happy with this course (I have purchased almost 90 courses on udemy and none of those can beat quality of this course)</p>","rating":5,"created":"2022-12-15T05:21:56-08:00","like":38,"dislike":3,"user":{"name":"Atul sain","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>it was a wonderful to experience learning from him. He is an exceptional instructor. He covered  everything quite precisely and you are really going to learn a lot if you follow him all along. Alhamdulillah, wonderful experience</p>","rating":5,"created":"2022-12-11T04:43:22-08:00","like":56,"dislike":7,"user":{"name":"Dawood Tahir","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>It's one of the best courses I ever took on Udemy, 5* to Daniel and to Andrei, simple, objective, and easy to follow along, in two words awesome course, if you want to learn TensorFlow this is the way to go, thank you so much :-)</p>","rating":5,"created":"2022-12-11T22:41:05-08:00","like":36,"dislike":7,"user":{"name":"Miguel Filipe Oliveira Lourenço","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I was able to pass the certification exam after taking this course. Highly recommended. Just be aware of # of hours you would need to dedicate to finish the course.</p>","rating":4.5,"created":"2022-11-24T13:30:10-08:00","like":89,"dislike":9,"user":{"name":"Ryo Yamaki","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>It would be a bit better if there is more explanation about the math behind the concepts we're studying. Other than that, this course is pretty great!</p>","rating":4.5,"created":"2022-10-24T01:26:36-07:00","like":12,"dislike":3,"user":{"name":"Dinakaran Karunakaran","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>It is a very very complete course. Of course it does not cover everything which would require a much bigger course. But they teach very well with several examples and well explained.<br>They are not boring, always making little comments to make the class enjoyable and not something you would get tired off. <br>I learned a lot and did some ML and NN that actually work in my real life problems.. <br>To summaryze - Trully recommend it! <br>Congratulations for the great course!</p>","rating":5,"created":"2022-10-21T13:15:17-07:00","like":70,"dislike":1,"user":{"name":"Arthur José Germano","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>AMAZING content with best student engagement plus a motivation to ask dumb questions and very smoothly explained, just like how my mind might wander through it.</p>","rating":5,"created":"2022-11-11T16:13:58-08:00","like":88,"dislike":7,"user":{"name":"SJ Pixels","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course delivered on what it promised. I took 1 week after completing the course for continued study and review then took the exam and passed!  By profession I am a Software Engineer, but I began this course with zero TensorFlow experience. This course covers far more information than what the exam will test you on, but provides a great well rounded foundation to build from. The course is really long, but I highly recommend taking the time to do all the challenges and extra-curriculum exercises at the end of each section.  The only thing that wasn't really covered well in this course that you'll likely want to be comfortable with before taking the exam is working with models that include LSTM and GRU layers. </p>\n\n<p>Thank you Daniel Bourke for the great course!</p>","rating":5,"created":"2022-10-21T13:53:40-07:00","like":90,"dislike":4,"user":{"name":"John Armstrong","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Great walkthroughs. He goes through everything in depth, and though not too much theory behind it, he does provide GREAT resources on where to learn them.</p>","rating":4.5,"created":"2022-12-02T12:00:14-08:00","like":29,"dislike":9,"user":{"name":"Pj Villasista","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Great course. Covers lot more of fundamentals than just focusing on the certification. This course is enough to complete certification. </p>\n\n<p>Note: in the exam models are expected to be in '.h5' format, but in this course we save it in 'savemodel' format. While practising models in the course try saving all models in h5 format as some architectures are producing issues when saving in h5.  It is better to be prepared for h5 format as well.</p>","rating":5,"created":"2022-06-08T23:17:40-07:00","like":30,"dislike":1,"user":{"name":"Yoganand Nandakumar","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Daniel Bourke is an excellent instructor and he delivers the course in a very engaging way, keeping the listener focused on the topic.<br>The material does correspond to the requirements of the TensorFlow Developer Certificate program, however it does not provide in-depth information on how the deep learning experiments can be performed, which is required in getting a passing grade.</p>","rating":3.5,"created":"2022-10-20T06:31:06-07:00","like":1,"dislike":9,"user":{"name":"Davor Cokrlic","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Great content! Very hands-on course if you code along the instructor (Daniel). You get lots of practice throughout, filled with resources to advance tensorflow learning. Glad to came across this course on Udemy, and highly recommend anyone wanting to learn tensorflow.</p>","rating":5,"created":"2022-09-10T11:03:13-07:00","like":86,"dislike":1,"user":{"name":"Abhinav Srivastva","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course is truly excellent. I've been through several Udemy courses on DL and this is by far the best. The very logical step-by-step approach is very effective, as is the emphasis on writing LOTS of code.</p>","rating":5,"created":"2022-11-19T10:52:15-08:00","like":45,"dislike":6,"user":{"name":"Robert McWilliams","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Your course is nice and helpful. A good crash course in tensorflow. However, after attempting the developer exam after your course, you cover a lot of extra, superfluous things that are not on the exam, while not covering core, key concepts that would have been more helpful on the exam. More time should be spent on LSTMs, different types of nlp classification, and time series. You should also go into more detail about ways to increase accuracy, such as dropouts, batch normalization, and how the types of layers you show actually work. The exam is tested on how well the models do, and in most sections of the course, none of the models perform all that well. In your fashion mnist example you only build a model that is 90% accurate, but you can get it to 99%, so if that came up on the exam, using the techniques you showed would not garner a passing grade. If you intend for this course to be enough for someone to pass the exam you need to cover things more in depth and show how to get models performing at the highest caliber possible.</p>","rating":3,"created":"2022-08-18T09:09:47-07:00","like":38,"dislike":10,"user":{"name":"Alex Konic","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I studied Tensorflow,NumPy,Keras,MatplotLib with many examples, and I knew how to code programs. So I understood how to build neuro network  and apply them to actual problems.<br>Besides, Daniel taught me how to solve errors in programs, it is very helpful for me when I actually develop AI for my problems.<br>Before I studied this course, I had studied Python, Tensorflow, NumPy and MatplotLib. So I understood most of Daniel's explanation. I think that students should study Python and some libraries before you start this course.<br>Thank you, Daniel. See you again!</p>","rating":5,"created":"2022-07-31T23:30:54-07:00","like":33,"dislike":9,"user":{"name":"秋山 俊恭","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course took me around 2 months to finish. The instructor will teach Tensorflow in a way that is enjoyable and simple. I even got the TensorFlow certification around 3 months after starting the course!</p>","rating":5,"created":"2022-08-06T10:48:08-07:00","like":84,"dislike":0,"user":{"name":"Pretham Nandakumar","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Extremely helpful and very practical course that thoroughly discusses ins and outs of building ML models. After this course, I'm definitely confident to take on serious ML problems and do further research if needed.</p>","rating":5,"created":"2022-11-12T21:40:06-08:00","like":43,"dislike":4,"user":{"name":"Ivan Keene","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I higly recommend this course for everyone who wants be an Deep Learning Enginner...</p>\n\n<p>Hi! I'm very happy because I already finished the whole course..!!</p>\n\n<p>This course is very efficient and prepare you, not only to pass the TensorFlow Certification, this also prepare you to be a DL (Deep Learning) Enginner.</p>\n\n<p>Of course, you need keep experimenting and practicing to improve your skills.</p>","rating":5,"created":"2022-08-22T15:34:24-07:00","like":40,"dislike":4,"user":{"name":"Derek Pérez","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I was disappointed that we didn't cover multi-label (image) classification. I had to look elsewhere for help with that, since I need it for some work-related projects.</p>\n\n<p>The time series section is overly long and too complicated. There are better example datasets than Bitcoin prices, in my opinion. I felt like I was just being given a lecture about why you can't use models to predict the stock market.</p>\n\n<p>Coding along is hard because of all the typos in the video tutorials. It also gets gradually harder to do anyway, because the syntax gets more complex as we’re going along.</p>\n\n<p>Response times to questions can be slow - or sometimes you don't get an answer at all.</p>\n\n<p>The amount of supporting resources is good, though. The slides, books, etc. are definitely things you'll be using over time.</p>","rating":2.5,"created":"2022-08-08T13:01:44-07:00","like":46,"dislike":4,"user":{"name":"Jeffrey B.","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}}]}