{"viewer":439331,"avg_rating":4.7,"num_reviews":97156,"course_id":"63bab4513cf2cdf181aac2ca","reviews":[{"content":"<p>I learned so much from this course, one of the best i've done on the Udemy Platform. I find that if i took the time to take notes on the lecture and then go into my code and make tweaks after the concepts seemed to stick! I will be doing to 3D dev course next!</p>","rating":5,"created":"2022-12-30T10:53:55-08:00","like":27,"dislike":8,"user":{"name":"George Ramon Check","avatar":"https://img-b.udemycdn.com/user/50x50/16259736_ec26.jpg"}},{"content":"<p>Overall the course is great, I had a lot of fun working on the projects and building stuff. Not to nitpick, the structure of which components were implemented were sometimes unclear and it would take me some time where I would just leave the course and look at how all the classes are connected and even make adjustments to ensure I have a good understanding of where things are.<br>This is of course a beginner course; but even with a few years of software engineering experience, I did find it hard to follow some parts where many components were introduced first then connected later as we do not have the full picture.</p>\n\n<p>Other than that, a lot of the course content is super useful and I was able to extend my learnings to add a few nice touches to the projects as I worked on them, and feeling like I am beginning to get the hang of things within unity.<br>Keep it up everyone, appreciate this great content and keeping the course up-to-date.</p>","rating":4,"created":"2022-12-15T14:24:43-08:00","like":13,"dislike":4,"user":{"name":"Sherif Nosseir","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This was my second time attempting this course. I believe it served me well, and aim to continue learning and creating my own games :)</p>","rating":4.5,"created":"2022-12-03T08:47:17-08:00","like":62,"dislike":2,"user":{"name":"Arturo Cesareo-Zacarias","avatar":"https://img-b.udemycdn.com/user/50x50/120169914_b9fb.jpg"}},{"content":"<p>Cannot thank you guys enough for all this knowledge i acquired with you. The course was overall super great i loved it so much!. I had a little bit of difficulties on Quiz Master but that's fine i love the challenge! I also lose focus sometimes but it's a problem on my side and i'll work to improve :)</p>\n\n<p>I am once again thanking both Gary and Rick which were 2 absolutely fantastic coaches and i really recommand this course if you're beginning Unity and C# and don't know exactly where to start!</p>\n\n<p>I'll follow some of your other courses as well to become a lot better, i promise i'll be a great game dev in the future. :)</p>","rating":5,"created":"2022-12-03T00:28:25-08:00","like":47,"dislike":2,"user":{"name":"Kapten >:/","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I had loads of fun doing this course and I learned plenty more than my moneys worth. Thank you to both the instructors for this knowledge and fun experience!</p>","rating":5,"created":"2022-11-13T02:40:51-08:00","like":44,"dislike":9,"user":{"name":"Paul D. Nadon","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I did this course previously before it got changed, and after having a break from GameDev i saw this course was changed so went over the whole thing once again.  </p>\n\n<p>In my opinion changing the course was a good thing, except for the quiz master part. *Im at section 62*, And the new teacher seriously just went \"Im gonna adjust my If statements (From last course) but this is just a personal preference of mine. You dont have to follow along if you dont have to\" This is the worst.. You give 1 lecture explaining how to do something, the next you change the entire if/else setup into something else because of own preferences, either causing confusion to beginners because youre changing things around or causing it to be overcomplicated.</p>\n\n<p>Very very demotivating to continue the quiz-game section of this course, this is not the first bad experience i have in this section with this teacher,  but this is the one that went over the edge in my opinion.</p>\n\n<p>Like come one.. If he gets payed to do this, that is a literal waste of money XD.</p>\n\n<p>Moving on to Tilevania</p>","rating":3,"created":"2022-08-05T05:02:54-07:00","like":20,"dislike":5,"user":{"name":"Mike Breedveld","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Great content.  Really useful having the challenges throughout to make you stop and think.  Occasionally they were a little bit tricky, but overall well targeted for someone who has done some coding before.</p>","rating":4.5,"created":"2022-11-28T00:14:43-08:00","like":19,"dislike":5,"user":{"name":"Michael Woolfenden","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Coming from zero background experience in game development, I found this course practical and concise which made it easy follow and stay engaged. Already having a background in programming made things a little bit easier to pick up, but I think this course does a great job at slow feeding programming concepts so that someone with 0 programming knowledge could learn.</p>","rating":5,"created":"2022-12-31T22:57:34-08:00","like":20,"dislike":4,"user":{"name":"Brian Quach","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Hi, this is a review from someone who completed the entire course.<br>I think a lot of reviews are excited people who've reviewed it before completing it - which is really cool but not always the most accurate.</p>\n\n<p>Immediately I'd recommend this course to anyone. It teaches you the both the editor and c# scripting. <br>In particular Rick is a very, very good teacher. He goes over things in a good pace and also explains everything well. <br>Both Gary and Rick also to make sure that nothing is assumed and show what they ask you to do and do it themselves so you can follow along if you get lost.</p>\n\n<p>My main critique is Gary's lessons - I think Gary also has a good pace, and also makes sure to demonstrate a lot that he does, but I found when he was doing certain things with scripting in particular I got really lost. Like he uses certain terms or words in scripting and just assumes that you know if he created his own variable or if it's something that already comes with unity etc etc.<br>I also think Gary does really well, but he does have the more harder content to demonstrate, so in that regard he's fighting uphill with harder content which isn't fair on him to be the fall guy for those two sections.</p>\n\n<p>Overall I think these directed lessons helped me more than any undirected youtube series has and now I feel set up for any future udemy courses or even undirected youtube tuts. <br>In the end I definitely dont feel ready to make my own simple game yet but I'm confident I can get there now.</p>\n\n<p>If you're wondering whether the course is worth it, the TLDR is YES - it's worth the money and it stops you wasting time on youtube that is less focused.</p>\n\n<p>Thanks guys and I'll be onto the next course !</p>","rating":3.5,"created":"2022-10-03T21:51:30-07:00","like":69,"dislike":9,"user":{"name":"Luke Mortison","avatar":"https://img-b.udemycdn.com/user/50x50/17336654_3202.jpg"}},{"content":"<p>I've enjoyed the course and I have already purchased a couple of other similar ones. I'm a complete beginner to C# and Unity and I found Rick Davidson's lectures alot easier to follow than Gary Pettie's. I think some of the C# concepts in the Quiz game and Space shooter are just a bit harder to grasp. Overall though it's great value and a really good way to get into C# coding.</p>","rating":4,"created":"2022-12-21T07:23:23-08:00","like":60,"dislike":5,"user":{"name":"Gary Fowler","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>My first ever Unity game development course, overall it is awesome :)</p>\n\n<p>Although some part might be too quick or too hard to understand at first hand, it is encouraged also to do some survey when you have something just doesn't understand or just because of your own curiosity.</p>\n\n<p>Since I already have programming experience, I am very used to survey some part by myself, but for no-coding-experience learners, it is very important to also build a habit, not only just asking questions, but also:<br>- try to understand, read through Unity manuals<br>- search through course questions, usually some other people already have questions you might wonder, in this case you could refer to the solutions<br>- survey on Google<br>- when related to Coding problems (like C# thingy), websites like Stackoverflow is a good place to search for answers</p>","rating":5,"created":"2022-10-30T12:09:42-07:00","like":0,"dislike":3,"user":{"name":"Alexius Huang","avatar":"https://img-b.udemycdn.com/user/50x50/80248220_43c8.jpg"}},{"content":"<p>All in all, it was an amazing course, for beginners with lots of basic and somewhat advanced concepts. I really liked the \"challenges\" concept.</p>","rating":5,"created":"2022-12-28T04:52:58-08:00","like":34,"dislike":9,"user":{"name":"Vasileios Maragkos","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Absolutely fantastic course I definitely gonna buy all your other courses :) Thank you so much guys ... you are funny you are great ... hope will be the same good as you ... one day :)</p>","rating":5,"created":"2022-11-04T11:49:24-07:00","like":95,"dislike":9,"user":{"name":"Petr Juricek","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>For 5 stars the Quiz Master should get more love from you.<br>Time.deltaTime should also be used in other games than Laser Defender only.<br>We didn't use the FixedUpdate method even though we manipulated a RigidBody.<br>I would have liked to see more about ScriptableObject and best practices in general.</p>","rating":4,"created":"2022-09-21T21:26:53-07:00","like":39,"dislike":3,"user":{"name":"Christian Schwind","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Generally course was really great, improvement could be made though.<br>Like adding more information about code design (Singleton etc...) which is so important in my opinion, or they skip the basic requirements like for games like pausing the game with right method.</p>","rating":4.5,"created":"2022-09-04T10:13:31-07:00","like":52,"dislike":9,"user":{"name":"Ugur","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Rediscovering my love for videogame development :)<br>Well explained, project-oriented course, also, huge thanks for updates!</p>","rating":5,"created":"2022-12-23T18:28:22-08:00","like":9,"dislike":7,"user":{"name":"Trofimov Boris","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Course is very progressive with no prior knowledge necessary. there are two instructors, 1 main and one that takes you through 2 of the modules, this gives variety. the course is well constructed, and explanations of core concepts are given. it's very informative and not just a \"copy this\"/\"write what I write\" course. you make the challenges concurrently to the instructor but there are also bits, generally after something similar has been taught, where the instructor will set a challenge and you are expected to figure out something for yourself.</p>","rating":5,"created":"2022-11-03T11:27:08-07:00","like":38,"dislike":0,"user":{"name":"Francisco Canham","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>Good teaching.. Helped me learn the basics of 2d game dev and now i am confident about making my first 2d game. Thank you</p>","rating":5,"created":"2022-12-28T06:37:19-08:00","like":31,"dislike":1,"user":{"name":"Debarghya Basak","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>I got this course during the pandemic but had difficulties sticking to it back then. This year I started from scratch and have to say: it's wonderful. The course has changed totally They improved so much, you start developing easy games where you see the results immediately and the boring stuff is taught later on so you want to go back and implement them on the games before. It is worth every cent that I have spent.</p>","rating":5,"created":"2022-09-18T21:21:38-07:00","like":67,"dislike":4,"user":{"name":"Caner Ates","avatar":"https://img-b.udemycdn.com/user/50x50/anonymous_3.png"}},{"content":"<p>This course surprised me, at first I didn't expect much but for the price this course will leave you with the skills needed to develop your own games without any hesitation. I strongly recommend you buy this course if you are interesting in game development and want to understand the fundamentals of C#. There is 1 section of this course, the \"Quiz Master\" section to be precise, where things seem to be harder to understand but that is the only negative thing I have to say.</p>","rating":4.5,"created":"2022-08-12T06:09:23-07:00","like":46,"dislike":7,"user":{"name":"Ethan Circuitt","avatar":"https://img-b.udemycdn.com/user/50x50/113756638_38a2_4.jpg"}}]}